app/Controllers/Api.php

                if ($elogin == "" || $password == "") {
                    echo "preencha corretamente";
                } else {
                    $login = $db->table('usuarios')->where('email', $elogin)->where('senha', $password)->countAllResults();


                    if ($login == 1) {
                        $usuario = $db->table('usuarios')
                          ->getWhere(['email' => $elogin, 'senha' => $password])
                          ->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `email` = 'jonathan@gmail.com'
AND `senha` = '87cd084d190e436f147322b90e7384f6a8e0676c99d21ef519ea718e51d45f9c'
SELECT *
FROM `usuarios`
WHERE `email` = 'jonathan@gmail.com'
AND `senha` = '87cd084d190e436f147322b90e7384f6a8e0676c99d21ef519ea718e51d45f9c'

                        session()->set($datasesi);
                        echo "logado";
                    } else {
                        $logine = $db->table('entregadores')->where('email', $elogin)->where('senha', $password)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `entregadores`
WHERE `email` = 'jonathan@gmail.com'
AND `senha` = 'ea6f766ab92906c945b2c3b83e1a49ca4c30cfa613b5a9922ffe467a8f0f4f64'

    public function apicon()
    {
        if ($_SERVER['REQUEST_METHOD'] == 'POST') {
            $db = \Config\Database::connect();
            $eid = session()->get('eid');
            $elogin = session()->get('elogin');
            $password = session()->get('password');
            if ($eid == "" || $elogin == "" || $password == "") {
                header("Location: " . base_url('login'));
                die();
            } else {
                $login = $db->table('usuarios')->where('email', $elogin)->where('senha', $password)->where('id', $eid)->countAllResults();

                if ($login == 1) {
                    $pedidos = $db->table('pedidos')->where('id_usuario', $eid)->where('status', 'entregue')->get()->getResult();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `email` = 'jonathan@gmail.com'
AND `senha` = 'ea6f766ab92906c945b2c3b83e1a49ca4c30cfa613b5a9922ffe467a8f0f4f64'
AND `id` = '1'
SELECT *
FROM `pedidos`
WHERE `id_usuario` = '1'
AND `status` = 'entregue'