app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `email` = 'jonathan@gmail.com'
AND `senha` = 'ea6f766ab92906c945b2c3b83e1a49ca4c30cfa613b5a9922ffe467a8f0f4f64'
AND `id` = '1'
SELECT *
FROM `pedidos`
WHERE `id_usuario` = '1'
AND `status` not like '%entregue%'
AND `status` not like '%cancelado%'
---
    public function painel()
    {
        $db = \Config\Database::connect();
        $eid = session()->get('eid');
        $elogin = session()->get('elogin');
        $password = session()->get('password');
        if($eid == "" || $elogin == ""|| $password == "") {
            header("Location: " . base_url('login'));
            die();
        } else {
            $login = $db->table('usuarios')->where('email', $elogin)->where('senha', $password)->where('id', $eid)->countAllResults();


            if ($login == 1) {

                // Seleciona todos os pedidos da tabela
                $pedidos = $db->table('pedidos')
                        ->where('id_usuario', $eid)
                        ->where('status not like', '%entregue%')
                        ->where('status not like', '%cancelado%')
                        ->get()
                        ->getResult();